# 1) მიიყვანეთ ჯგუფური პროექტები საბოლოო ეტაპამდე
# დამთავრებულია

# 2) შექმენით ფუნქცია რომელსაც არგუმენტად ინტეჯერების სიას და მომხმარებლის პასუხს გადასცემთ. მომხმარებელს აარჩევინეთ ამ სიიდან ერთ-ერთი რიცხვი და დათვალეთ თუ რამდენჯერ მეორდება ეს რიცხვი სიაში.
def arr(user):
    elbuja = input("chose: ")
    return user.count(elbuja)

print(arr(['apple', 'apple', 'banana', 'strawbery']))

# 3) შექმენით ფუნქცია, რომელსაც გადასცემთ 2 არგუმენტს: სია, მომხმარებლის პასუხი. ფუნქციის მიხედვით მომხმარებელს ჰკითხე სურს თუ არა სიის გასუფთავება. თუ დაგთანხმდება გაასუფთავე სია თუ არა მაშინ ჩვეულებრივად გამოიტანე ეს სია ტერმინალში.
def yes_or_no(arr, ch):
    if ch == 'no':
        return arr
    elif ch == "No":
        return arr
    elif ch == 'yes':
        return []
    elif ch == 'Yes':
        return []
    else:
        return arr

luiza = input('y/n: ')

print(yes_or_no([1, 2, 3, 4, 5, 0], luiza))

# 4) შექმენით სია სახელად Fruits და ჩაამატეთ მასში ხილი. მომხმარებელს შემოატანინეთ ინდექსი და შემდეგ  ამ ინდექსზე მდგომი ელემენტი ამოშალე სიიდან. საბოლოოდ დაბეჭდე სიის საბოლოო ვერსია.
Fruits = ['apple', 'dragon', 'banana', 'cocunt', 'mango']
user = int(input('enter index: '))
print(Fruits.pop(1))

# 5) დაწერეთ ფუნქცია, რომელიც შეამოწმებს არგუმენტად გადაცემული რიცხვი მარტივია თუ არა. (მარტივია რიცხვი, თუ მას მხოლოდ ორი გამყოფი აქვს). მინიშნება: გამოიყენეთ For loop და % გამყოფი ოპერატორი.
# ვერ გავიგე

# რესურსი: