# შექმენით items ცვლადი, რომელშიც შინახავთ მინიმუმ 10 ტექნიკას (მაგ. კომპიუტერი, მიკროფონი, ა.შ). გამოიტანეთ Items სიიდან ყოველი მეოთხე ელემენტი  Slicing-ის გამოყენებით.
item = ["კომპიუტერი", "ტელეფონი", "ფლეისთეიშენი", "მიკროფონი", "ტელევიზორი", "რადიო"]
print(item[3:4])

# შექმენით Fruits ცვლადი და შეინახეთ მასში მინიმუმ 7ც ხილი. შეაბრუნეთ Fruits სია, შემდეგ Slicing-ის გამოყენებით გამოიტანეთ სიის ბოლო 3 ელემენტი.
Fruits = ["mango", "melon", "grape", "apple", "strawbery", "cocount", "cherry"] 
print(Fruits[4:])

# რას ეწოდება Slicing? ახსენით დეტალურად კომენტარებით. ამასთანავე ახსენით Slicing-ის სინტაქსი (პლიუს start, stop, step როგორ მუშაობს)
#  Slicing-არის როცა ვჭრით/ვიღებთ ელემენტს, პირველი რიცხვი არის start, მეორე stop, მესამე step. start-ით იწყებს გამოტანას, stop-ჩერდება, step-ი ტოვებს რიცხვს

# მოიყვანეთ მაგალითი თუ რატომ არის სტრინგი შუცვლელიმონაცემის ტიპი
# სტრინგი  პირველი სიმბოლოს შეცვლის მცდელობას იწვევს errors-ს რადგან სტრინგები Python-ში შუცვლელია   სიმბოლოების შეცვლა არ შეიძლება. თუ გვსურს შევცვალოთ ტექსტი უნდა შევქმნათ ახალი სტრინგი. 