# 1) დაწერეთ ფუნქცია და გადაეცით მას ორი რიცხვი. პასუხად დააბრუნეთ ის რიცხვი, რომელიც ამ ორი ინტეჯერიდან ყველაზე დიდი იქნება
def Hehe(list):
    new_list = sorted(list)
    return new_list[-1]

print(Hehe([1, 3]))

# 2) შექმენით ფუნქცია, რომელსაც გადასცემთ ინტეჯერების სიას. ფუნქციამ უნდა დააბრუნოს მეორე ყველაზე მცირე ელემენტი.
def intger(num):
    new_list = sorted(num)
    return new_list[0]

print(intger([2, 3, 4, 5, 6, 1]))

# 3) შექმენით ფუნქცია, რომელსაც გადასცემთ ინტეჯერების სიას. ფუნქციამ უნდა დააბრუნოს მეორე ყველაზე დიდი ელემენტი.
def p(didi):
    new_list = sorted(didi)
    return new_list[-1]

print(p([1, 2, 99, 9999999999999999999999999999999999999999999999999999999999999999999999999999999]))

# 4) დაწერეთ ფუნქცია, რომელიც დააბრუნებს True-ს თუ არგუმენტად გადაცემული სტრინგის პირველი და ბოლო ასო ერთმანეთს ემთხვევა
def true_value(num):
    me_string = Hehe
    if num[0:1] == me_string[-2:-1]:
        return True
    else:
        False

print(true_value('H.dide'))