# თქვენი სიტყვებით ახსენით:
# • რას ეწოდება ფუნქცია?
# • რისთვის გამოიყენება ფუნქციები Python-ში.
# ფუნქცია არის რომელ კოდსაც ბოლოში ფჩხილები აქვს

# კომენტარის სახით დაწერეთ, რას ეწოდება არგუმენტი. როგორც გაკვეთილზე ავხსენით ნახაზის საშუალებით - ასევე თქვენც გევალებათ, რომ Paint-ში ახსნათ ფუნქციის სინტაქსი და მისი არგუმენტები.
# არ გუმენტი არის ინფორმაცია მაგალითდ რამეს რომ ჩაწერ პრინტში რასაც წერ პრინტში ის უკვე არ გუმენტია

# შექმენით ისეთი სია, სადაც შეინახავთ ყველა ნასწავლ მონაცემთა ტიპს ორ-ორჯერ, რომლებსაც მოათავსებთ სხვადასხვა ინდექსებზე. ბოლოს ინდექსინგის საშუალებით გამოიტანეთ მხოლოდ Boolean მნიშვნელობები. 
# -- for loop --
lists = ["deme", 7, 7.0, True, "siuu", False]
print(lists[3:4], lists[-1:])

# შექმენთი სია [2, 4, 6, 8, 10].
# გადაუარეთ for ციკლით და სიის ელემენტების გაორმაგებული მნიშვნელობები ეკრანზე დაბეჭდეთ.
numbers = [2, 4, 6, 8, 10]

for i in numbers:
    print(numbers * 2)

# იპოვეთ და დაბეჭდეთ 1-დან 100-მდე რიცხვების თანმიმდებრობიდან მხოლოდ ის რიცხვები, რომლებიც იყოფა 5-ზე.
# -- while loop --
for i in range(1,100):
    if i % 5 == 0:
        print(i)


# დაწერეთ პროგრამა, სადაც მომხმარებელს შემოატანინებთ რიცხვებს მანამ, სანამ ის არ შეიყვანს 0-ს. ბოლოს დაბეჭდეთ ყველა მცდელობაზე შემოტანილი რიცხვების ჯამი.
num = 0

user_num = int(input("enter a number: "))

while user_num != 0:
    print("incorrect number try again")
    user_num = int(input("enter a number: "))
    num += user_num
print("correct number")
print(num)

#  while loop-ის გამოყენებით იპოვეთ და დაბეჭდეთ 1-დან 30-მდე მხოლოდ ლუწი რიცხვები.
# -- Indexing & Slicing --
num = 1

while num <= 30:
    if num % 2 == 0:
        print(num)
    num += 1

# დაწერეთ პროგრამა, სადაც მომხმარებელს აარჩევინებთ ნებისმიერ სტრინგს, შემდეგ კი მოცემული სტრინგიდან მხოლოდ კენტ ინდექსზე მდგომ ელემენტებს გამოიტანს ტერმინალში.
# -- Conditional Statements --
user_str = input("შეიყვანეთ სტრინგი: ")
print(user_str[1])
print(user_str[3])
print(user_str[5])
print(user_str[7])
print(user_str[9])
# დაწერეთ პროგრამა, რომელიც შეადარებს მომხმარენლის მიერ შემოტანილ ორ რიცხვს და დაბეჭდავს, რომელი უფრო მეტია ან ტოლია.
number1 = float(input("შეიყვანეთ პირველი რიცხვი: "))
number2 = float(input("შეიყვანეთ მეორე რიცხვი: "))

if number1 > number2:
    print("პირველი რიცხვი უფრო მეტია მეორეზე.")
elif number1 < number2:
    print("მეორე რიცხვი უფრო მეტია პირველს.")
else:
    print("ორივე რიცხვი ტოლია.")

# მომხმარებელს შემოატანინეთ ასაკი. გამოიყენეთ პირობითი განცხადებები რომ შექმნათ პროგრამა, სადაც - იმ შემთხვევაში თუ User იქნება 13 წელზე ნაკლენბი ასაკის გამოიტანთ 'You are a child'. თუ იქნება 13 წელზე მეტი, მაგრამ 18-ზე ნაკლები ასაკის დაუბეჭდეთ 'You are a teen'. თუ 18 წელზე მეტის იქნება დაუბეჭდეთ 'You are an adult.'
# მომხმარებლის ასაკის შეყვანა
age = int(input("enter your age: "))

if age < 13:
    print("You are a child.")
elif age < 18:
    print("You are a teen.")
else:
    print("You are an adult.")
