// 1) აუცილებლად დაასრულეთ დავალება:

// შექმენით სარეგისტრაციოი გვერდი, სადაც გექნებათ name, surname, email, password ინფუთები.
// გამოიყენეთ localStorage და შეინახეთ მომხმარებლის მიერ შემოყვანილი მონაცემები. დამახსოვრებული მონაცემები ინფუთების ქვემოთ გამოიტანეთ შემდეგ ფორმატში:
// `Name: ${name}`
// `Surame: ${surname}` 
// და ა.შ
// თქვენს სარეგისტრაციო ფორმაში დაწერეთ ისეთი ლოგიკა, რომ როდესაც თქვენი პროგრამა input-ებში შემოყვანილ მონაცემებს localStorage-ში იპოვის (ყველა მონაცემი უნდა ემთხვეოდეს) მაშინ საიტზე წითელი პარაგრაფის სახით გამოუტანეთ მომხმარებელს, რომ მსგავსი მომხმარებელი უკვე დარეგისტრირებულია.

// 2) შეასრულეთ Frontend Mentor-ის პროექტი. (HTML & CSS + JS)
// ვეწევი ჯერ მასალას