let arr = [0, 1, 2, 3, 4]; // ვქმნით შეცვლად ცვლადს სადაც ვინახავთ arrary-ის
let result = 0; // ვქმნით ისევ შეცვლად ცვლადს სადაც ვინახავთ 0

for(let i =  0; i < arr.length; i ++){ // ვუვლით ფორ ლუპით
    let val = arr[i] // ვქმნით ისევლ შეცვლად ცვლადს სადაც ვინახავთ arr-ს მნიშვნელობას
    if(val && val % 2 === 0){ // თუ val არის თრუ და არის ლუწი
        result += val // რესულთში ვამატებთ val-ს
    }
    else if(val || val === 0){ // თუ val არის ფოლსი
        result += val ? 1 : 10  // result += val თუ val 1-ია სხვა შემთხვევაში 10
    }
    else{
        result += 100 // სხვა შემთხვევაში ვუმატებთ 100 
    }
}