# 1) კომენტარის სახით ახსენით თუ რატომ ვიყენებთ კომენტარებს პითონში.
# კომენტარი აღინიშნება ჰეშთეგით კომენტარი იმისთვის არის, რომ არ გამოვიტანო ტერმინალში ჩვენი დაწერილი ან უბრალოდ რომ ეწეროს რას ვაკეთებ ოღონდ რასაც კომენტარის სახით დაწერ ტერმინალში არ გამოიტანს ანუ შეგიძლია კომენტარის სახით მიუწერო რას აკეთებ!

# 2) ჩამოწერეთ ის საუკეთესო პრაქტიკები რაც ჩვენ დღეს ვისწავლეთ.


# 3) გაასწორეთ მოცემული კოდები:

# 1. first_user = "Lika"
# 2nduser = "Giorgi"
# print(first user)
first_user = "lika"
nduser2 = "giorgi"
print(first_user)

# 2. first name = Data
# last % name = "random"
first_name = "Data"
last_name = "random"

# 4) რას გამოიტანს ეს კოდი?
# Num1 = 20
# num2 = 30
# print(num1 + num2)
# ეს კოდი გამოიტანს ერრორს რადგან num1 ცვალდი არ გვაქვს და გვაქვს ჩვენ Num1 ცვლადი