# 2) რას ეწოდება Tuple unpacking? მოიყვანეთ მინიმუმ 3 მაგალითი (Asterisk ოპერატორის გამნოყენების და გამოყენების გარეშეც)
# თაფლი არის იგივე სია ოღნდ მანდ კვადრატული ფრჩხილების მაგივრად როგორც ესეთია -> [] არ იწერება იწერება ასე -> ()  და ვერ გამოიყენებ ისეთ ფუნქციებს რომელიიც ცვლის ამ სიას მაგ -> reverse, sort, pop, remove, removed, sorted, reversed, min, max, append, insert.

# 3) კომენტარის სახით ჩამოწერეთ რომელი მეთოდების/ფუნქციების გამოყენებაა შესაძლებელი Tuple-ებზე.
# count, index, find, len და რომელიც არ ცვლის ამ tuple-ბს

# 4) კომენტარის სახით ჩამოწერეთ რომელი მეთოდების/ფუნქციების გამოყენება არ არის ხელმისაწვდომი Tuple-ებზე.
# sort, min, max, reverse, remove, pop, append, reversed, removed, insert და რომელიც ცვლის tupl-ებს.

# 5) შექმენით Tuple სახელწოდებით info, სადაც შეინახავთ თქვენს მონაცემებს (სახელი, ასაკი, მისამართი ა.შ). მასში შეინახეთ 5 მონაცემი და მოახდინეთ თაფლის unpacking: თითოეულ მონაცემს შესაბამისი ცვლადის სახელი შეისაბამეთ (name, age, etc..)
tuple_info = ('deme', '10', 'gori')
print(tuple_info)

# 6) შექმენით Tuple, რომელშიც შეინახავთ მთელ და წილად რიცხვებს. Tuple_ის პირველ ელემენტს დაარქვით num1, დანარჩენი ელემენტები კი rest ცვლადში შეინახეთ Asterisk ოპერატორის გამოყენებით.
tpl = (1.1, 1.5, 6.7, 5.1, 6.1, 6.9)
num1, *rest = tpl
print(tpl)