# 1) დენაგირება debaging არის სინტაქსურად რამე რომ შეგვეშლება და ტერმინალი გვიხსნის რომ რაშეგვეშალა

# 2) 1 TypeError ეს ხდება როცა არასწორად ვიყენებთ მონაცემთა ტიპეპს
# 2 ValureError  ხდება როცა სწორ ტიპს აქვს არასწორი მნიშვნელობა
# 3 NameError ცლადი ან ფუქცია მანამ სანამ ის განისაზღვრა
# 4 IndexError ის ხდება როცა სიის სტრინგის ან სხვა ინდექსირებადი ობიექტს არარსებულ ინდექსე წვდომის მცდელობა
# 5 KeyError ლექსიკონში არარსებული გასაღების წვდომა
# 6 AttributeError ეს ხდება როცა ობიექტს არ გააჩნია მითითებული ატრიბუტი ან მეთოდი
# 7 ImportError მოდულის ან მისი ნაწილის იმპორტის შეცდომა

# 3) 1 name = "deme"
# print(namme) ეს შეცდომა რადგან ორი m არ უნდა ეწეროს ანუ არ უნდა ეწეროს - namme და უნდა ეწეროს name
# 2 number = 5 
# text = " apples"
# result = number + text
# print(result) აქ არის შეცდომა რომ არ უნდა მივუმატოთ ტექსტს ტექსტი
# 3 name = lika
# name2 = naame + "4"
# აქ არის შეცდომა რომ ტექსტს არ უნდა მიუმატო რიცხვი და არის კიდევ არ უნდა ეწეროს - naame  და უნდა ეწეროს - name კიდევ არის თუ ტექსტი არ იწყება პრჭყალით და რიცხვს მივუმატებთ პრჭყალებიან რიცხვ

# 4)  კოდი გამოიტანს book pages book