# ახსენით თუ რისთვის არის საჭირო კარგი პრაქტიკების გამოყენება კოდის წერის დროს;
# კარგი პრაკტიკები არის საჭირო რადგან სორედ დავწეროთ კოდი და მომხარებელს უკეთ ვაცნობოთ ჩვენო საიტი ან შევაყვაროთ, მოვაწონოთ

# შექმენით ორი ცვლადი და მათში შეინახეთ რიცხვები. შეასრულეთ ყველა ის მათემატიკური ოპერაცია, რაც აქამდე ვისწავლეთ და თითოეული ეს ოპერაცია შეინახეთ ცვლადებში. საბოლოოდ დაბეჭდეთ ამ ცვლადის მნიშვნელობები. რაც ყველაზე მთავარია - ამ დავალების შესრულებისას, თითოეულ ხაზზე კომენტარიებით უნდა ახსნათ თუ რა მოქმედებებს ასრულებთ.
num1 = 20
num2 = 10

# მიმატება +
print(num1 + num2)

# გამოკლება -
print(num1 - num2)

# გამრავლება *
print(num1 * num2)

# გაყოფა /
print(num1 / num2)

