// 1) განმარტეთ კომენტარის სახით რა სხვაობაა გლობალურ და ლოკალურ სკოუპს შორის 
// გლობალური არის რომელიც ყველა კოდის ხაზე მუშაობს და გამოძახება შეგვიძლია ვგულისხმობ რომ მაგ:
// მაქვს ეს ცვლადი
let name = "demetre" // ვადეკლარებთ შეცვლად ცვლადს




console.log(name) // ვიძახებთ ცვლადს სახელად name-ს გამოიტანს deme-ს

// ამით ის ვიგულისხმე რომ გლობალური არის რამდენი ხაზით დაბლაც არ უნდა იყოს ტერმინალში მაინც დაბეჭდავს/გამოიტანს
// ხოლო რა არის ლოკალური! ლოკალური ეწოდება მხოლოდ ერთგან რო შეგვიძლია გამოყენება მაგლითად გლობალური ხო არის რაც ყველგანაა მაგარითად ჰაერი ყველგანა და ლოკალური იქნება სადაც მხოლოდ ერთგანაა მაგ:

{
    let color = "blue" // ვადეკლარებთ ცვლადს შეცვლადს და შიგ ვინახავთ სტრინგს სახელად blue cვლადს სახელად color გადაეცემა
    console.log(color)
}

// console.log(color) ასე არასწორეა რადგან მხოლოდ შეგიძლიათ ფუნქციააში გამოტანა

// 2) შექმენით ცვლადი გლობალურად და გამოიძახეთ ფუნქციაში 
let country_geo = () => {  // ვადეკლარებთ ცვლადს შეცვლად ვინახხავთ სტრინგ ობიექტს სახელს ვანიჭებთ country
    let country = "georgia"
    console.log(country) // ვიძახებთ country-ს
}

// 3) შექმენით ფუნქცია შიგნით შექმენით ცვლადი დაპრინტეთ ფუნქციის გარეთ გაუშვით კოდი და ნახეთ რა შედეგი იქნება კომენტარის სახით ახსენით რატომ მიიღეთ ეგ შედეგი 
{
    let color2 = "red" // ვადეკლარებთ ცვლადს შეცვლადს ვინახავთ სტრინგ ობიექტს სახელს ვანიჭებთ color2 - ს
}

console.log(color2) // ეს იმიტომ არ გამოაქვს რომ როგორც ვიცით scope ფუნქცია არის ლოკალური და ასე მუშაობს გვაქვს ხერხები რითიც შეგვიძლია გამოვიძახოთ მაგალითად
