// 1) ჩამოწრეთ ყველა ის იტერატორის მეთოდი რომლებიც თქვენ იცით, თითოეულის დანიშნულება ახსენით კომენტარების სახით
// filter - ფილტრავს, findIndex - ძებნის ინდექს, map - მაპ მეთოდი გამოიყენება იმისთვის რომ გადავუაროთ ჩვენ array-ის და ჩავატაროთ ოპერაციები, forEach - გადაუვლის ისე როგორც ფორრ ლუპი,  

// 2) შექმენით მასივი სადაც შეინახავთ რიცხვებს 1 - 10 ჩათვლით, თქვენი დავალებაა, რომ console - ში გამოიტანეთ თოთო ელემენტი forEach - მეთოდის გამოყენებით
const nums = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

nums.forEach((num) => console.log(num))

// 3) map - მეთოდის გამოყენებით numbers - მასივში არსებული თითო ელემენტი გადაამრავლეთ 2 - ზე, და გამოიტანეთ ახალი მასივი
console.log(nums.map((num) => num * 2))

// 4) findIndex - მეთოდის გამოყენებით console - ში გამოიტანეთ ისეთი რიცხვის index - რომელიც მეტია 3 - ზე
console.log(nums.findIndex((num) => num > 3))

// 5) numbers მასივი გაფილტრეთ ისეთი რიცვებისგან რომლებიც მეტია 5 - ზე
console.log(nums.filter((num) => num > 5))