# 2) ჩამოწერეთ Set-ის ძირითადი განმასხვავებელი თვისებები.
# არ ინახავს დუბლიკათ ელემენტებს, არეულად ლაგდება, შეგიძლია ელემენტების დამატება ან წაშლა

# 3) ასევე ჩამოწერეთ ყველა set-ის ფუნქცია რაც განვიხილეთ და თითოეულზე მოიყვანეთ მინ. 1 მაგალითი.
# add - დაამატებს ელემენტს, remove ამოშლის რისი სახელსაც ეტყვი, set() - გადააქცევს სეტად, clear - ყველა მონაცემს შლის, union - ერთმანეთს ამატებს, 

# 4) შექმენით set, სადაც დაამატებთ 10 რიცხვს, აქედან 3 რიცხვი დუპლიკატი უნდა იყოს. დაბეჭდეთ set ტერმინალში და დააკვირდით შედეგს.
set1 = {1, 1, 1, 2, 3, 4, 5, 6, 7, 9}
print(set1)
# როგორც ვთქვი დუბლიკატებს არ გამოიტანს და სეტიც არეულად იქნება

# 5) შექმენით languages set-ი, სადაც დაამატებთ პროგრამირების იმ ენებს, რომელიც აქამდე ვისწავლეთ ( ამ შემთხვევაში შეგიძლიათ html & css ჩათვალოთ ). პირველ რიგში ამოშალეთ set-იდან JavaScript-ი, შემდეგ დაამატეთ React და გამოიტანეთ განახლებული სეტი ტერმინალში.
languages = {'html', 'css', 'javascript'}
languages.remove('javascript')
languages.add('react')
print(languages)

# 6) შექმენით სეტი, სადაც დაამატებთ ქვეყნის დასახელებებს. .clear() მეთოდის გამოყენებით გააასუფთავეთ სეტი და მასში ცალ-ცალკე ჩაამატეთ ქალაქის დასახელებებიშედეგი ასახეთ ტერმინალში.
countries = {'georgia', 'russia', 'turkye', 'germany', 'india'}
countries.remove('russia')
countries.add('france')
countries.add('usa')
print(countries)

# 7) რას გამოიტანს ეს კოდი? შედეგი ახსენით დეტალურად.

# set1 = {'apple', 'banana', 'cherry'}
# set2 = {'banana', 'orange'}
# combo = set1.union(set2)
# print(combo)

# ეს გამოიტანს {'apple', 'banana', 'cherry', 'orange'} რადგან union set–ებს კრიბავს და set-ებში არ შეგვიძლია გამოვიყენოთ დუბლიკატები banana 2-ჯერ არ განმეორდება