// 1) დაასრულეთ ორივე პროექტი 159-ე ლეველიდან.
// ვეწევი მასალას

// 2) ახსენით setTimeout-ის დანიშნულება და მისი სინტაქსი.
// setTimeout-ს გადაეცემა ორი მნიშნელობა პირევლი რა უნდა გამოიტანოს და მეორე როდის 

// 3) დაწერეთ კოდი, რომელიც კონსოლში გამოიტანს ტექსტს 'This is javaScript' ზუსტად 3 წამის დაგვიანებით.
setTimeout(() => {
    console.log("This is javaScript")
}, 3000)

// 4) შექმენით კოდი, რომელიც მაშინვე დაბეჭდავს: "პროცესი დაიწყო".
// 2 წამის შემდეგ დაბეჭდავს: "შუალედური ეტაპი".
// კიდევ 1 წამის შემდეგ (ანუ ჯამში 3 წამში) დაბეჭდავს: "დასრულდა!".
console.log("პროცესი დაიწყო")

setTimeout(() => {
    console.log("შუალედური ეტაპი")
}, 2000)

setTimeout(() => {
    console.log("დასრულდა!")
}, 3000)

// 5) შექმენით ფუნქცია სახელით greet, რომელიც იღებს სახელს და ბეჭდავს: "Hello, {name}".
// გამოიყენეთ setTimeout ისე, რომ ეს ფუნქცია ამოქმედდეს 1.5 წამში და გადაეცით მას თქვენისახელი არგუმენტად.
function greet(name){
    setTimeout(() => {
        console.log(`Hello, ${name}`)
    }, 1500)
}

greet("deme")

// 6) დაწერეთ კოდი, რომელიც 3 წამში დაბეჭდავს "BOOM!".
// თუმცა, იქვე დაწერე მეორე setTimeout, რომელიც 2 წამში გააუქმებს (clearTimeout) პირველ ტაიმერს, ისე რომ "BOOM!" საერთოდ არ დაიბეჭდოს.
let boomTimer = setTimeout(() => {
    console.log("BOOM!")
}, 3000)

setTimeout(() => {
    clearTimeout(boomTimer)
    console.log("Timer canceled")
}, 2000)

// 7) დაწერეთ for ციკლი, რომელიც 1-დან 5-მდე ციფრებს დაბეჭდავს, ოღონდ თითოეულ ციფრს შორის უნდა იყოს 1 წამიანი ინტერვალი.
for(let i = 0; i <= 5; i ++){
    setTimeout(() => {
        console.log(i)
    }, i * 1000)
}

// 8) გადახედეთ ჩანაწერის იმ ნაწილს თავიდან, სადაც Event Loop-ს ვხსნი.
// გადავხედე

// 9) უყურეთ ვიდეოს და კარგად გაიაზრეთ ის:
// გადავხედე