// დაასრულეთ საკლასო დავალებები:

// 2) მომხმარებელს შემოაყვანინეთ რიცხვი ( 0 - 100 ) 
// ქულის მიხედვით დაადგინეთ შეფასება:

// 90--100 -> "A"
// 80--89 -> "B"
// 70--79 -> "C"
// 60--69 -> "D"
// 0--59 -> "F" 
// სხვა მნიშვნელობის შემთხვევაში -> "invalid score"
// (გამოიყენეთ switch case) 

// 3) for loop-ის გამოყენებით დაბეჭდეთ რიცხვები 1-დან 10-მდე.

// 4) for loop- ის გამოყენებით დაბეჭდეთ 1-დან 20-მდე მხოლოდ ლუწი რიცხვები.

// 5) for loop-ის გამოყენებით დაბეჭდეთ 1-დან 5-ის ჩათვლით ციფრების კვადრატები.

// 6) for loop-ის გამოყენებით დაბეჭდეთ რიცხვები 35-დან 15-მდე.

// დამატებით შეასრულეთ:
// 7) კომენტარის სახით js-ის ფაილში ჩამოწერეთ loop-ის გამოყენების დადებითი მხარეები.

// 8) სქემის სახით დახაზეთ JavaScript-ის for loop-ის სინტაქსი და შემადგენელი კომპონენტები. (+ კიდევ ერთხელ გადაავლეთ თვალი ჩაგდებულ რესურსებს)

// 9) დაწერეთ for loop, რომელიც გამოიტანს "Group 71 is the best"-ს კონსოლში 150-ჯერ.

// 10) prompt-ის გამოყენებით შემოატანინეთ მომხმარებელს სახელი და გვარი. გამოიყენეთ for loop, რომ კონსოლში მისი info 10-ჯერ გამოიტანოთ.