# 1) დაწერეთ ფუნქცია, რომელსაც გადასცემთ ინტეჯერების სიას არგუმენტად. პასუხად დააბრუნეთ სიაში არსებული რიცხვების საშუალო არითმეტიკული.
def average(num1):
    return len(num1) / len(num1)

# 2) შექმენით ფუნქცია, რომელიც არგუმენტად მიიღებს სტრინგს.
# ფუნქციამ უნდა დაითვალოს მოცემულ სტრინგში ხმოვნების რაოდენობა.
def sum(num1):
    lsn = 'aeiou'
    bla = 0
    for i in num1:
        if i in lsn:
            bla + 1
    return bla


# 3) დაწერეთ ფუნქცია და გადაეცით არგუმენტად სია.
# ფუნქციამ სიის თითოეული ელემენტი უნდა დააბრუნოს კვადრატში
def sum(num1, num2):
    return sum