// შექმენით ფუნქცია getProducts რომლის დავალებაც იქნება, რომ გააგზავნოს მოთხოვნა ამ API - ზე: "https://fakestoreapi.com/products" და დააბრუნოს შედეგი, შემდგომ საიტზე შექმენით ერთი div ბლოკი და ღილაკი, როდესაც ღილაკზე დაკლიკება მოხდება ეს დივ ბლოკი უნდა გაივსოს პროდუქტებით

// პროექტს რომელიც დღეს დავიწყეთ დაუმატეთ შემდეგი ფუნქციონალი: როდესაც მომხარებელი დაამატებს პროდუქტებს cart - ში, დაბლა უნდა გამოუჩნდეს საბოლოო თანხა (რამდენი უნდა გადაიხადოს ამ პროდუქტებში ჯამში), ღილაკი "Bye now" და "Delete from cart", როდესაც დააკლიკავს "Bye now" - ს cart - ი  უნდა გასუფთავდეს და ნაყიდი პროდუქტები უნდა წაიშალოს products მასივიდან (ანუ საიტიდან), თუ დააკლიკავს კონკრეტულ პროდუქტზე "Delete from cart" - ს მაშინ ეს პროდუქტი უნდა წაიშალოს კალათიდან, ასევე თვითონ საიტზე გამოიტანეთ პროდუქტების შესახებ მეტი ინფორმაცია.

// ლამაზად გასტილეთ საიტი
let btn = document.getElementById("btn")

btn.addEventListener("click", () => {
    
})

let res = []