# 1) დეტალურად განიხილეთ (კომენტარის სახით) და გაიაზრეთ მოცემული კოდი:
# ეს გამოიტანს 5 [1]

# 2) დაწერეთ ფუნქცია, რომელიც არგუმენტად მიიღებს რიცხვების სიას და დააბრუნებს მხოლოდ ლუწი რიცხვების ჯამს.
def blabla(list):
    total = 0
    for i in list:
        if i % 2 == 0:
            total += i
    return total

print(blabla([1, 2, 3, 4, 5, 6, 7, 8, 9, 10]))

# 3) დაწერეთ ფუნქცია, რომელიც მიიღებს ორ არგუმენტს — ტექსტს და ასოს — და დააბრუნებს, რამდენჯერ გვხვდება ეს ასო ტექსტში ( გაითვალისწინეთ case სენსიტიურობა) 
# ვერ გავიგე

# 4) დაწერეთ ფუნქცია, რომელიც მიიღებს ორ სიას და დააბრუნებს სიას, სადაც მხოლოდ საერთო ელემენტებია. მაგ:
# ვერ გავიგე