// შექმენით ფილმების ვებსაიტი. მთავარი ფუნქციონალი:
// - Sign-in/Sign-up LocalStorage-ით. (ცალკე გექნებათ My account გვერდი დამატებული საიტზე. მომხმარებელს  შეეძლოს ფოტოს დაყენება პროფილზე)

// - Movie API-დან წამოიღეთ ფილმების მონაცემები და გამოიტანეთ საიტზე. 
// თითოეულ ფილმს ჰქონდეს - დასახელება, პოსტერი, გამოშვების წელი, რეიტინგი. (სასურველია ხანგრძლივობა, რეჟისორი)
// უნდა იყოს შესაძლებელი sorting: რეიტინგის მიხედვით, გამოშვების მიხედვით და ა.შ
// (დიზაინი თქვენით მოიფიქრეთ/ან Figma გამოიყენეთ). ინპირაცია აიღეთ ფილმების საიტებიდან.

// - Movie search (ფილტრაციით). 

// - Watchlist-ი. თითოეულ ფილმს დაუმატეთ 🩷/⭐ icon-ი, მასზე დაკლიკებამ ეს ფილმი მომხმარებლის Watchlist-ში უნდა გადაიტანოს. (Watchlist-ს ცალკე გვერდიც დაუთმეთ)

// ძირითადი page-ები:
// HomePage,
// User profile
// Watchlist
// გაკეთებული მაქვს სხვა ფაილში