# შექმენით ფუნქცია, რომელიც არგუმენტად მიიღებს მომხმარებლის სახელსა და ასაკს. ფუნქციამ უნდა დააბრუნოს მსგავსი წინადადება:
# "მომხმარებლის სახელი" არის "მომხმარებლის ასაკი" წლის.
name = input("enter your name: ")

age = input("eneter your age: ")

def user_info(name, age):
    return f"{name} is {age} age"
print(user_info(name, age))

# შექმენით ფუნქცია, რომელიც არგუმენტად მიიღებს ერთ რიცხვს და საბოლოოდ პასუხად დააბრუნებს ამ რიცხვის კვადრატს. (რიცხვის ხარისხში აყვანის ოპერატორია **)
def kvadrati(x):
    return x ** 2
print(kvadrati(5))

#  შექმენით ფუნქცია და გადაეცით ორი რიცხვი პარამეტრებად. ფუქნციამ უნდა დააბრუნოს პირველი რიცხვი აყვანილი მეორე რიცხვის ხარისხში 
def bla(num1, num2):
    return num1 ** num2
print(bla(2,3))


#  შექმენით ფუნქცია სახელწოდებით sum, რომელსაც არგუმენტად გადაეცემა 3 რიცხვი და ფუნქციის მიზანი იქნება, რომ ამ სამი რიცხვის ჯამი დააბრუნოს.
def sum(b, l, a):
    return b + l + a
print(1, 2, 3)

# შექმენით ფუნქცია სახელწოდებით substract, რომელსაც არგუმენტად ორ რიცხვს. ფუნქციამ პასუხად უნდა დააბრუნოს ამ რიცხვების სხვაობა.
def substract(num1, num2):
    return num1 - num2
print(substract(100, 50))

# შექმენით ფუნქცია სახელწოდებით multiply, რომელსაც არგუმენტად ორ რიცხვს. ფუნქციამ პასუხად უნდა დააბრუნოს ამ რიცხვების ნამრავლი.
def multiply(a, b):
    return a * b
print(multiply(5, 5))

# შექმენით ფუნქცია სახელწოდებით divide, რომელსაც არგუმენტად ორ რიცხვს. ფუნქციამ პასუხად უნდა დააბრუნოს ამ რიცხვების განაყოფი.
def divide(x, y):
    return x / y 
print(divide(25, 5))