# Level 01:
# 1) გადახედეთ დღევანდელი გაკვეთილის ჩანაწერს. ვუყურე

# 2) გაიარეთ რეგისტრაცია Sololearn-ზე. დავრეგისტრირდი

# 3)  გაიარეთ Introduction to Python - Memory & Variables ჩათვლით. ok

# 4) თქვენი სიტყვებით ახსენით რა არის ცვლადი და რაში გვჭირდება ის, ასევე ასხენით თუ რა დანიშნულება აქვს კომენტარს Python-ში. 
# ცვლადი არის ყუთში შენახული ნებისმიერი ტიპის ინფორმაცია

# 5) გაიხსენეთ ყველა ის მონაცემთა ტიპი, რომელიც ვისწავლეთ. თითოეული ამოწერეთ Python-ის ფაილში და print() ბრძანების საშუალებით დაბეჭდეთ თითოეული მონაცემთა ტიპის 5-5 მაგალითი (Boolean-ის შემთხვევაში მხოლოდ 2 მაგალითი).
# string, boolean, integer, foloat.
print("hello world")
print("GOA")
print("group 71")
print("deme")
print("leader")

print(71)
print(9)
print(10)
print(39)
print(41)

print(10.9)
print(1.5)
print(1.1)
print(1.9)
print(1.1000)

I_have_got_pet = False
me_age_is_blablabkla = False

meme_ar_var_asi_wlis = True
me_myavs_cxoveli = True

# 6) ყოველდღე გააკეთეთ 100 Push-up, 200 პრესი, 100 squat.

# 7)  გაიცანით თქვენი ჯგუფელები, დაიმეგობრეთ, და გაუზიარეთ შთაბეჭდილებები, იმეცადინეთ ერთად, შეიყვარეთ ერთმანეთი. 
# ვისაც გაიცნობთ, ყველას სახელი და გვარი ამოიწერეთ day01.txt ფაილში და ატვირთეთ Github-ზე. 
# ლაზარე, სემი.

# 8) გამოიწერეთ Low Budget Stories youtube არხი და უყურეთ ვიდეოებს
