# 1)  შექმენით ფუნქცია და გადაეცით რიცხვების სია არგუმენტად. ფუნქციის მიზანი იქნება, რომ სიიდან დააბრუნოს მხოლოდ უარყოფითი რიცხვები.
def sum(lists):
    lists2 = []
    for i in lists:
        if i < 0:
            lists2.append(i)
    return lists2
print(sum([22, 55, -5, 2 , -24, -23]))

# 2) წინა დავალების ანალოგიურად შექმენით ფუნქცია და გადაეცით რიცხვების სია არგუმენტად. ამ შემთხვევაში ფუნქციის მიზანი იქნება, რომ სიიდან დააბრუნოს მხოლოდ დადებითი რიცხვები.
def sum1(list):
    x = []
    for i in list:
        if i > 0:
            x.append(i)
    return x

print(sum([-4, 3, 23 -3, 3, 3, -3]))

# 3) შექმენით ფუნქცია და მას პარამეტრად  გადაეცით სამი რიცხვი. ფუნქციამ უნდა დააბრუნოს პირველი რიცხვი აყანილი მეორე რიცხვის ხარისში და გამრავლებული მესამე რიცხვზე.
def numb(num1, num2, num3):
    return (num1 ** num2) * num3
print(numb(5, 5, 3))