# 1) შექმენით ფუნქცია, რომელიც პარამეტრად მიიღებს რიცხვების სიას და დააბრუნებს ყველა რიცხვის ნამრავლს. 
def sum(lists):
    x = 1
    for i in lists:
        x *= i
    return x

me_lists = [2, 3, 4]
print(sum(me_lists))

# 2) შექმენით ფუნქცია, რომელიც არგუმენტებად მიიღებს სტრინგს და სიმბოლოს. ფუნქციამ in keyword-ის გამოყენებით უნდა შეამოწმოს არის თუ არა მოცემული სიმბოლო სტრინგში. თუ არის — დააბრუნოს "Found", თუ არა — "Not found".
def blabla(num1, num2):
    if num2 in num1:
        return "Found"
    else:
        return "Not found"

print(blabla('hello world', 'h'))

# 3) დაწერეთ ფუნქცია, რომელიც პარამეტრად მიიღებს სტრინგს და დააბრუნებს მის შებრუნებულ ვერსიას.
def x(num):
    return num[::-1]

print(x('blabla'))

# 4) შექმენით ფუნქცია, რომელიც პარამეტრად მიიღებს სიას და დააბრუნებს ახალ სიას, სადაც მხოლოდ უნიკალური ელემენტები იქნება — ანუ თქვენი დავალებაა სია გაფილტროთ duplicate ელემენტებისგან.
# ვერ გავიგე

# 5) დაწერეთ ფუნქცია და გადაეცით ორი არგუმენტი: სია და ელემენტი. ფუნქციამ ჯერ უნდა შეამოწმოს შეიცავს თუ არა სია მოცემულ ელემენტს, თუ შეიცავს ფუნქციამ უნდა დააბრუნოს ამ ელემენტის სიგრძე. თუ არგუმენტად გადაცემული ელემენტი სიაში არ მოიძებნა - მაშინ დააბრუნეთ უშუალოდ სიის სიგრძე.
def y(list, element):
    if element in list:
        return len(element)
    else:
        return len(list)

print(y(['bla', 'b', 'l', 'a'], 'b'))
print(y(['bla', 'b', 'l', 'a'], 'r'))


# 6) თავიდან ბოლომდე გადაიმეორეთ ფუნქციები პითონში და დამატებით დამოუკიდებლად შეასრულეთ პრაქტიკული სავარჯიშოები ❗❗