// 2) შექმენი ერთი global ცვლადი და ერთი local ცვლადი ფუნქციაში.
// დაბეჭდე ორივე და ნახე რომელი იმუშავებს.
let global = "i don't know"
let local = "i don't know again"

console.log(global)
console.log(local)

// 3) 
// function test() {
//   let x = 10;
// }
// console.log(x)
// ახსენით რა არის შეცდომა და როგორ უნდა გავასწოროთ
// ფუნქციაში არ ვაბრუნებთ და ამიტომ გარეთ რას გაიგებს კონსოლი რა არის x ამიტომ რომ გავასწოროდ კონსოლოგი ერთით მაღლა უნდა ავიტანოთ

// 4) let name = "Anna";
//    function showName() {
//        let name = "Luka";
//        console.log(name);
//  }
//  showName();
//  console.log(name);

// რას გამოიტანს მოცემული კოდი ? ახსენით რატომ
// ჩვენ ამით ვამუშავებთ ფუნქციას 24 ხაზე რაც არის ამით გამოგვავქვს ფუნქცია რაც არის ხოლო ჩვენ 18 ხაზე გვაქვს კიდევ ცვლადი ამიტომ როგორც წეღან ვახსენე არ იმუშავებს ფუნქციაზე და ამით ჩვენ ფუნქციას კი არა ფუნქციის გარეთ რაც არის ცვალდი იმას ვიძახებთ შედეგად ანას ხოლო ტერმინალი დაბეჭდავს: Luka
//                               Anna