# კომენტარის სახით ჩამოწერეთ ყველა სტრინგის მეთოდი, რომელიც ისწავლეთ. თითოეულს მიუწერეთ დეტალური განმარტება და მათზე მოიყვანეთ თითო-თითო მაგალითი. მომხმარებელს შემოატანინეთ სიტყვა. ტერმინალში კი დაბეჭდეთ ეს სიტყვა ისე რომ იყოს:  1. ყველა პატარა ასო; 2. ყველა დიდი ასო; 3. პირველი ასო დიდი, ხოლო ყველა დანარჩენი პატარა.
# დღეს ვისწავლეთ კოდები .lower, .upper, .capitalize. .lower-ი  აპატარავებს ყველა ასოს, .upper კი ადიდებს ყველა ასოს და .caitalize კი მხოლოდ პირველ ასოებს ადიდებს
# მაგალითები:
print("GOA" .lower()) 
print("group 71" .upper())
print("siuu" .capitalize())

# მომხმარებელს შემოატანინეთ სამი წინადადება და თითოეულზე გამოიყენეთ სხვადასხვა სტრინგის მეთოდი: 
# პირველ წინადადებაზე — .lower()
# მეორე წინადადებაზე — .upper()
# მესამე წინადადებაზე — .capitalize()
str1 = input("enter a text: ")
str2 = input("enter a text: ")
str3 = input("enter a text: ")

print(str1.lower())
print(str2.upper())
print(str3.capitalize())

# ცვლადში შეინახე შენი სახელი. მომხმარებელს შეეკითხე თავისი სახელი, იმ შემთხვევაში თუ თქვენი სახელები ემთხვევა დაბეჭდეთ "Our names are similar!", თუ არ ემთხვევა დაბეჭდეთ "We have different names". გაითვალისწინეთ, რომ მომხმარებელმა შეიძლება თქვენნაირი სახელი შემოიტანოს, თუმცა სახელის ასოები შესაძლოა იყოს სხვადასხვა შრიფტის ზომით, ამიტომ ამან თქვენ პროგრამაში შეფერხება არ უნდა გამოიწვიოს (გამოიყენეთ ნასწავლი სტრინგის მეთოდები)

sukhita = "deme" 
user_name = input("enter a name: ").capitalize()

if sukhita == user_name:
    print("Our names are similar!")

else:
    print("We have different names")

# ცვლადში შეინახეთ წინადადება, დაწერეთ ისეთი პროგრამა რომ მხოლოდ წინადადების პირველი ასო იყოს დიდი ასოთი, დანარჩენი კი იყოს პატარა.
text = "siuu"
text_sentence = text.capitalize()
print(text_sentence)

# ცვლადში შეინახეთ რაიმე სტრინგი, შემდეგ .find() ფუნქციის მეშვეობით იპოვეთ რომელ ინდექსზეა კონკრეტული ასო.
name = "deme sukhitashvili"
name1 = name.find("s")
print(name1)

# შექმენით სია, სადაც დაამატებთ რანდენიმე სტრინგს. სიაში დამატებული თითოეული სტრინგი გადაიყვანეთ დიდ ასოებად for ციკლის მეშვეობით.
str1 = ["Goa", "Group 71", "MMA", "siuu"]
list1 = [""]
for i in str1:
    list1 += i.upper()
print(list1)

# ჩანაწერს გადახედეთ თავიდან.
# გადავხედე!