# 1) დაწერეთ პროგრამირებაში დაშვებული შეცდომების ორი კატეგორია. კომენტარის სახით ჩამოწერეთ Error-ების ტიპები, რომლებიც განვიხილეთ.# აქვს exept რომელიც აჩერებს კოდს ყველა ერორზე ხოლო ექსეპტს შეგვიძლია მივუთითოთ რომელიმე ტიპის ერორი სადაც შეგვხვდება გაჩერების მაგივრად გამოიტანს სასურველი ტექსტი, გვაქვს კიდევ try მანდ ვწერთ თუ ერორი არ არი უბრალოდ გამოვიტანოთ ან რაც გვინდა sintaxerorr, num error, index error, indetaciis erori value erori.
# აქვს exept რომელიც აჩერებს კოდს ყველა ერორზე ხოლო ექსეპტს შეგვიძლია მივუთითოთ რომელიმე ტიპის ერორი სადაც შეგვხვდება გაჩერების მაგივრად გამოიტანს სასურველი ტექსტი, გვაქვს კიდევ try მანდ ვწერთ თუ ერორი არ არი უბრალოდ გამოვიტანოთ ან რაც გვინდა sintaxerorr, num error, index error, indetaciis erori value erori.

#2) შექმენით სია და სცადეთ დაბეჭდოთ ელემენტი, რომელიც სიის range-ის საზღვარს გარეთ იქნება. except-ში დაბეჭდეთ: “Such index doesn’t exist”
names = ["deme", "nika", "giorgi", "saba"]
try:
    print(names)
except IndexError:
    print("Such index doesn't exist ")