# 1) დაწერეთ ფუნქცია, რომელიც მიიღებს რიცხვს და დააბრუნებს მის ორმაგ მნიშვნელობას.
def double_number(number):
    return number * 2
print(double_number(5))

# 2) შექმენით ფუნქცია, რომელსაც არგუმენტად გადასცემთ 3 რიცხვს. ამ ფუნქციამ პასუხად უნდა დააბრუნოს პირველი ორი რიცხვის ჯამი გაყოფილი მესამე რიცხვზე.
def blabla(a, b, c):
    return (a + b) / c
print(blabla(2, 5, 6))

# 3) შექმენით ფუნქცია, რომელიც არგუმენტად მიიღებს სიას და ტერმინალში დაბეჭდავს სიის ყველა ელემენტს.
# ვერ გავიგე!

# მოცემული დავალებების შესასრულებლად გამოიყენეთ return keyword.