// 1) კომენტარის სახით ჩამოწერეთ ყველა მონაცემის ტიპი, რაც დღეს ვისწავლეთ და თითოეულს დაუწერეთ განმარტება. ამასთანავე, კონსოლში გამოიტანეთ თითოეული მონაცემის ტიპის მაგალითი.

// 2) ცვლადებში შეინახეთ თქვენი სახელი, გვარი, ასაკი და მისამართი. კონსოლში კონკატინაციის საშუალებით გამოიტანეთ თქვენს შესახებ წინადადება (არ დაგავიწყდეთ Space-ები).

// 3) შექმენით ორი ცვლადი let keyword-ის მეშვეობით: num1 და num2. თითოეულში შეინახეთ მთელი რიცხვები და კონსოლში გამოიტანეთ მათ შორის შესრულებული 5 არითმეტიკული ოპერაცია. შემდეგ ამ ცვლადებს შეუცვალეთ მნიშვნელობები და კონსოლში დაბეჭდეთ ამ ახალი ცვლადების გამოყენებით შსრტულებული 5 არითმეტიკული ოპერაცია