import './App.css'
import { HelloUser } from './components/HelloUser'
import { ReactCool } from './components/ReactCool'

function App() {
// 1) CodeCademy | Your First React Component თავი ბოლომდე
// codeCademy-მ გაბაგა და ვერ ვწერ

return (
  <>
    {/* 2) შექმენი კომპონენტი, რომელიც აბრუნებს 'React is cool'-ს. დააექსპორტე და დაარენდერე საიტზე. */}
    <ReactCool/>
    {/* 3) შექმენი კომპონენტი, რომელიც მომხმარებელს მიესალმება ('Hello, User!') 5-ჯერ. */}
    <HelloUser/>
    <HelloUser/>
    <HelloUser/>
    <HelloUser/>
    <HelloUser/>
    {/* 4) შენი სიტყვებით ახსენი, თუ რა არის კომპონენტი და როგორ ვიყენებთ მას React-ში. */}
    {/* კომპონენტები გვეხმარება ყველაფრის ცალ ცალკე გამოტანაში და თანაც კოდი უფრო მალე ეშვება და ჩვენ რომ კომპონენტი შევქმნათ რეაქთში src-ში უნდა შევქმნათ ფოლდერი სახელად components და შიგნით შევქმნათ ფაილი დიდი ასოთი ფაილში დავაბრუნებთ ფუნქციას აუცილებლად უნდა ჰქონდეს დიდი ასოებით სახელი შემდეგ დავაექსპორტებთ და დავაიმპორტებთ App.jsx-ში და დავბეჭდავთ საიტზე */}
    {/* 5) მოიძიე 5 საიტი, რომელიც React-ითაა აწყობილი. (უმჯობესია იყოს ცნობილი კომპანიის). ასევე, საიტის პოვნის შემეგ იმსჯელე თუ საიტი როგორ შეიძლება იყოს დაყოფილი კომპონენტებად. */}
    {/* ოკ */}
    </>
  )
}

export default App