// 1) გადაიმეორეთ აქამდე გავლილი JS მასალა.
// ok

// 2) ივარჯიშეთ ბოლო 5 საშინაო და საკლასო დავალებაზე. (ყველა თავიდან დაწერეთ Level 116-ის ფოლდერში. აბსოლიტურად ყველას დავალებას შევამოწმებ ‼️


// 3) კომენტარის სახით ახსენით რას ეწოდება ფუნქცია და ზოგადად პროგრამირებაში რა დროს ვიყენებთ.
// ფუნქციას აქვს ბოლოში ფრჩხილები გვაქვს კიდევ ფუნქცია ბევრ რამეში გვეხმარება როგორიცაა length() ის გვეხმარება გავზომოთ სტრინგის სიის ან რაიმეს სიგრძე ოღონდ ინტეკერზე ვერა

// 4) დაასრულეთ საკლასო დავალება.
// ok chill

// 5) ახსენით Splice-ის სინტაქსი. +  მოცემულია მასივი:

// let arr = [10, 20, 30, 40, 50];
// წაშალეთ მასივიდან 30 და 40 ერთდროულად.

let arr = [10, 20, 30, 40, 50];

console.log(arr.splice(2, 2))
console.log(arr)

// 6) მოცემულია მასივი:

// let cities = ["Tbilisi", "Batumi", "Kutaisi", "London", "Rustavi"];
// შეამოწმეთ თუ მასივში არსებობს "London", წაშალეთ ის splice()-ით და აუცილებლად ტერნარი ოპერტაორი გამოიყენეთ.

let cities = ["Tbilisi", "Batumi", "Kutaisi", "London", "Rustavi"];

for(let i = 0; i < cities.length; i ++){
    if (cities[i] === "london"){
        console.log(cities.splice(i, 1))
        break
    }
    else{
        console.log("London არ არის სიაში")
    }
}