// 2) აუცილებლად დაასრულეთ საკლასო დავალება:
// შექმენით მასივი, რომელსაც დაარქმევთ 'bookLibrary'-ს. მასში ობიექტის სახით გქონდეთ ჩაწერილი ავტორის სახელი, წიგნის title და წიგნის ფოტო. ამ მასივში მინიმუმ 5 ასეთი ობიექტი უნდა ჩასვათ. 
// ცალკე ფაილში შექმენით კომპონენტი, რომელიც წიგნის სახელს, ავტორსა და ფოტოს გამოიტანს props-ების მეშვეობით. main ფაილში გადაუარეთ შექმნილ მასივ bookLibrary-ს map-ით და დაარენდერეთ ხუთივე წიგნი საიტზე. მაქსიმალურად დახვეწილად გასტილეთ.
// გადახედე საკლასო ფაილს ყველაფერი გაკეთებული მაქვს