# 1) დაწერეთ თქვენი ვარაუდი: რას გამოიტანს ეს კოდი?
# *fruit1, fruit2, fruit3 = fruits
# fruit2 მიიღებს ბოლოს წინას fruit-3 ბოლო და დანარჩენს fruit1 ვგულისხომბ დანარჩენი ორი თავისუფალი დარეჩბა

# 2) ახსენით რას აკეთებს Asterisk ოპერატორი და მოიყვანეთ რამოდენიმე მაგალითი.
# Asterisk-ი გამოიტანს დარჩენილ სიტყვებს მაგ. რაც პირველში მიწერია

# 3) ჩამოწერეთ რა მსგავსება და განსხვავებაა List-ებსა და Tuple-ბს შორის.
# 1) ფრჩხილები, 2) List-შეცვლადია Tuple-შეუცვლედი, 3) tuple-ზე რამდენიმეს გამოყენება შეგვიძლია მხოლოდ როგორიცაა count, len, sum, index, min, max არ შეგვიძლია იმის გამოყენება რაც შეცვლის სიტყვას

# 4) შექმენით Tuple, სადაც შეინახავთ 7 ელემენტს. გამოიყენეთ Tuple Unpacking იმისთვის, რომ 4 სხვადასხვა ცვლადში გადაანაწილოთ Tuple-ის ელემენტები. ოთხივე ცვლადი დაბეჭდეთ ტერმინალში.
fruits = ('bluberry', 'strawberry', 'cocunt', 'watermelon', 'mango', 'grape', 'six seveen')
fruits1, fruits2, fruits3, *fruits4 = fruits
print(fruits1)
print(fruits2)
print(fruits3)
print(fruits4)