// 2) კომენატრების სახით ახსენით ყველა ის მეთოდი რომლებიც დღეს ჩვენ გაკვეთილზე ვისწავლეთ როგორიცაა map, filter, forEeach, findIndex, კარგად გაიაზრეთ მოცემული მეთოდების დანიშნულება, და თქვენით გააკეთეთ რამოდენიმე მაგალითი
// filter - ფილტრავს, findIndex - ძებნის ინდექს, map - მაპ მეთოდი გამოიყენება იმისთვის რომ გადავუაროთ ჩვენ array-ის და ჩავატაროთ ოპერაციები, forEach - გადაუვლის ისე როგორც ფორრ ლუპი,  

// 2) შექმენით მასივი სადაც შეინახავთ რიცხვებს, თქვენი დავალებაა, რომ filter მეთოდის გამოყენებით ახალ მასივში ჩაამატოთ ისეთი რიცხვები რომლებიც იყოფა 2 - ზე (ანუ ლუწია), კომენტარების სახით ახსენით ცვლის თუ არა filter მეთოდი ორიგინალ მასივს, აბრუნებს თუ არა ის მნიშვნელობას
let nums = [2, 4, 6, 9, 2, 7]

console.log(nums.filter((num) => num % 2 === 0))

// 3) შექმენით მასივი სადაც შეინახავტრადიციულით  სხვადასხვა სახეობის ხილს, თქვენი დავალებაა, რომ forEach მეთოდის გამოყენებით ცალ - ცალკე გამოიტანოთ ხილის სახელები ისე, რომ წინ ეწეროს My favorite fruit is - ხილის სახელი, აგრეთვე ახსენით აბრუნებს თუ არა forEach - მნიშვნელობას, და რითი განსხვავდება ის  for loop - სგან
let fruits = ["water melon", "melon", "pinaple", "cocunt"]

fruits.forEach((name) => console.log(`me favorite fruit is ${name}`))

// 4) შექმენით მასივი სადაც შეინახავთ სახელებს, თქვენი დავალებაა, რომ map მეთოდის გამოყენებით გამოიტანოთ თითოეული სიტყვის პირველი ასო და გადააქციოთ ის დიდ ასოდ, callback ფუნქციის მიერ დაბრუნებული მნიშვნელობა შეინახეთ ახალ მასივში, map ფუნქციის მიერ დაბრუნებული ახალი მასივი კი გამოიტანეთ console - ში
let names = ["deme", "nika", "onise", "endri", "lika", "aleqsandre", "luka"]

let updatesNames = names.map((name) => {
    return name[0].toUpperCase()
})

console.log(updatesNames)

// 5) მოიძიეთ ინფორმაცია reduce მეთოდის შესახებ js - ში ახსენით მისი დანიშნულება და კარგად გაიაზრეთ მისი მუშაობა, შემდეგ კი შექმენით მასივი სადაც შეინახავთ რიცხვებს და reduce მეთოდის გამოყენებით გამოიტანთ მოცემული რიცხვების ჯამს

// მაგალითად
// [1, 2, 3, 4, 5] ——> 15
const num = [1, 2, 3, 4, 5]

const sum_of_num = num.reduce((acc, acc_vall) => {
    return acc + acc_vall
})

console.log(sum_of_num)

// 6) კომენტარების სახით ახსენით განსხვავება higher order function და callback ფუნქციას შორის, მოიყვანეთ მაგალითებიც
// height order function არის ფუნქცია რომელსაც არგუმენტად სხვა ფუნქცია გადაეცემა ხოლო callback დამხმარე ფუნქცია